(function() {
  'use strict';

  angular
    .module('mad')
    .factory('ErrorSrv', ErrorSrv);

  /** @ngInject */
  function ErrorSrv() {
    var error, getError;

    error = {
        '101': '令牌不存在或已经过期, 请重新登陆',
        '102':'用户名或密码错误',
        '103':'该用户邮箱未验证',
        '104':'该用户邮箱已被注册',
        '105':'该用户手机号已被注册',
        '106':'该用户手机号未验证',
        '107':'邮箱验证码过期或错误，验证失败，需要重新注册',
        '108':'参数不正确',
        '109':'',
        '111':'',
        '112':'',
        '113':'',
        '201':'广告不存在',
        '202':'广告类别错误',
        '203':'广告标题不能为空',
        '204':'投放地点错误',
        '205':'广告起始日期不能大于结束日期',
        '206':'广告状态错误',
        '207':'广告上传失败',
        '208':'广告下架失败',
        '209':'发布广告失败',
        '210':'保存草稿太频繁',
        '211':'',
        '301':'金额必须大于0',
        '302':'验证信息不完整',
        '303':'图片上传失败',
        '304':'退款金额大于余额',
        '305':'旧密码不对',
        '306':'行政区映射修改失败',
        '307':'',
        '308':'',
        '999':'未知错误'

    };

    getError = function(errCode) {
        return error[errCode];
    };

    return {
        getError: getError
    };
  }
})();
