(function() {
  'use strict';

  angular
    .module('mad')
    .factory('ErrorSrv', ErrorSrv);

  /** @ngInject */
  function ErrorSrv() {
    var error, getError;

    error = {
        '101': '令牌不存在或已经过期, 请重新登陆',
        '102':'旧密码不正确',
        '103':'新密码不能为空',
        '104':'用户名与密码不匹配',
        '105':'用户名格式非法（必须是11位手机号，以1开头）',
        '106':'该用户名已经被注册',
        '107':'该用户名不存在',
        '108':'验证码不正确',
        '109':'30秒内只能请求一次验证码',
        '111':'用户已经被禁用',
        '112':'该用户不存在',
        '113':'用户名不能为空',
        '501':'找不到管理权限',
        '502':'找不到管理权限组',
        '503':'管理员不能删除自己',
        '504':'权限组的名字不能为空',
        '505':'权限组已经有管理员，不能删除',
        '901':'分页参数不正确',
        '999':'未知错误'

    };

    getError = function(errCode) {
        return error[errCode];
    };

    return {
        getError: getError
    };
  }
})();
